<a href="https://colab.research.google.com/github/jaimeisaac2020/Python-analsisis-basicos/blob/mi-github/datos_faltantes_Python1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Manejo de datos faltantes en Python

In [32]:
import pandas as pd

In [33]:
datos=pd.read_csv("clientes.csv")

In [34]:
print(datos)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [35]:
print(datos['nombre'])

0       Juan
1      Luisa
2        NaN
3     Carmen
4        NaN
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

In [36]:
datos['nombre'].isnull()

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8    False
Name: nombre, dtype: bool

In [37]:
datos.isnull().sum()

nombre     2
edad       3
ingreso    3
dtype: int64

In [38]:
datos[datos['nombre'].isnull()]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [22]:
#datos.dropna(subset=['nombre','ingreso'],inplace=True)

In [23]:
datos.head()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
2     NaN  70.0  20000.0
3  Carmen  49.0  22000.0
4     NaN   NaN      NaN

In [29]:
#datos.fillna(0)

In [30]:
print(datos)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [31]:
#datos['nombre'].fillna('Desconocido')

0           Juan
1          Luisa
2    Desconocido
3         Carmen
4    Desconocido
5          Mario
6          Pedro
7        Gustavo
8         Carlos
Name: nombre, dtype: object

In [39]:
print(datos)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [40]:
media=datos['ingreso'].mean()

In [43]:
media

18000.0

In [41]:
mediana=datos['ingreso'].median()

In [44]:
mediana

17200.0

In [52]:
moda=datos['ingreso'].mode()[0]

In [53]:
moda

15800.0

In [56]:
datos['ingreso']=datos['ingreso'].fillna(moda)

In [57]:
print(datos)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN  15800.0
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0  15800.0
8   Carlos   NaN  15800.0